
{
    "navbar": {
        "about-me": "Profil",
        "skills": "Fähigkeiten",
        "projects": "Projekte"

    },
    "landingpage":{
        "titel": "Frontend Entwickler",
        "btn-1": "Meine Projekte",
        "btn-2": "Kontakt",
        "carousel":{
            "location": "Aus Ulm/Baden-Württenberg",
            "open-to-work": "Offen für neue Projekte",
            "remote-work": "Verfügbar für Remote-Projekte",
            "titel": "Frontend Entwickler"
        }
    },
    "Who-I-Am":{
        "headline": "Kurz zu mir",
        "headline-box": "Über mich",
        "personal-description":"Hi, ich bin Raphael! Frontend-Entwickler mit Leidenschaft für modernen Code und starkem Fundament aus der IT-Systemintegration. Ich verstehe sowohl die User-Interface-Seite als auch die Administration im Windows-Umfeld. Jetzt suche ich eine neue Herausforderung.",
        "location": "Sitz in Ulm an der Donau – einsatzbereit vor Ort oder Remote. Ich freue mich auf eine konstruktive Zusammenarbeit und neue Impulse!",
        "mindset": "Entschlossen, diszipliniert und immer bereit für das nächste Level: Ich liebe es, neue Technologien zu meistern und mein Wissen in die Entwicklung innovativer Lösungen zu stecken.",
        "approach": "Mein Ansatz ist pragmatisch: Ich zerlege komplexe Probleme in kleine, überschaubare Einheiten. Diese klare Analyse ermöglicht es mir, Schritt für Schritt effiziente und nachhaltige Lösungen zu entwickeln."
        
    },
    


    "technologies":{
        "comp-headline":"Technologien",
        "headline": "Fähigkeiten",
        "description": "Ich verfüge über solide Grundlagen in der Front-End-Entwicklung mit HTML, CSS, JavaScript, TypeScript, Angular, Firebase und Material Design, ergänzt durch Kenntnisse in REST-APIs, Git und Scrum. Ich entwickle gerne benutzerfreundliche, responsive Oberflächen und lerne ständig neue Tools, um in der Webumgebung effizient zu bleiben.",
        "another-skill": "eine",
        "another-skill-2":"weitere Fähigkeit?",
        "description-2" :"Kontaktieren Sie mich geren, ich freue mich von Ihnen zu lesen.",
        "btn-content": "Kontakt"
    },
    "portfolio":{
        "headline": "Ausgewählte Projekte",
        "description-1": "Entdecken Sie meine Projekte -",
        "description-2": "interagieren Sie mit den Projekten, machen Sie sich ein Bild meiner Fähigkeiten."

    },
    "others-about-me":{
        "headline": "Kollegen & Arbeitgeber Feedback...",
         "source": "Vollständiges Schreiben.",
        "content": {
            "0":{
                "autor": "Manuela Immendörfer",
                "text" : "Wir haben Herrn Zwick als absolut zuverlässigen und gewissenhaften Mitarbeiter geschätzt, der alle ihm übertragenen Aufgaben mit äußersrt großem Fleiß und durchdachtem Handeln erledigte. "
            },
            "1": {
                "autor": "Jennifer Thiel",
                "text":  "Lösungsorientierter Teamplayer, der durch diplomatische Kommunikation und proaktive Zusammenarbeit auch unter Druck den Teamzusammenhalt stärkt."
            },
            "2": {
                "autor": "Yannick Becker",
                "text":  "Engagierter Frontend-Entwickler mit Backend-Einblicken. Er bereicherte unser Kanban-Projekt durch seine strukturierte Arbeitsweise, Zuverlässigkeit und eine Kommunikation auf Augenhöhe."
            }
        }
        
    },
    "contact-me":{
        "headline": "Kontakt",
        "main-headline-1": "Gemeinsam",
        "main-headline-2": "durchstarten",
        "problem": "Got a problem to solve?",
        "description": "Mein Anspruch ist es, Projekte durch durchdachte Architektur und nutzerzentrierte Innovation nicht nur umzusetzen, sondern nachhaltig zu bereichern.",
        "link": "Frontend-Entwickler benötigt ?",
        "span": "Kontaktieren Sie mich!",
        "mailForm":{
            "name": "Wie heißen Sie?",
            "name-bsp": "Ihr Name steht hier",
            "name-error": "Oops! Ihr Name fehlt",
            "mail": "Ihre Email?",
            "mail-bsp": "ihreEmail@email.com",
            "mail-error": "Hoppla! Ihr Email-Adresse fehlt",
            "content": "Kann ich helfen ?",
            "content-bsp": "Hallo Raphael, ich interessiere mich...",
            "content-error": "Was möchten Sie entwickeln?",
            "input-content-1":"Mit der ",
            "link": "Datenschutzerklärung ",
            "input-content-2": "bin ich einverstanden.",
            "input-error":"Bitte die Datenschutzerklärung akzeptieren",
            "btn-content": "Absenden" 
        }  
    },
     "mail-overlay":{
        "headline":"Danke für ihre Nachricht. Sie hören bald von mir."
    },
    "project-overlay":{
        "headline":"Über das Projekt",
        "description":{
            "Join":"Task-Manager, inspiriert vom Kanban-System. Erstellen und organisieren Sie Aufgaben per Drag & Drop, weisen Sie Benutzer und Kategorien zu.",
            "El Pollo Loco":"Jump-and-Run-Spiel auf objektorientierter Basis. Helfen Sie Pepe, Münzen und Tabasco-Salsa zu sammeln, um gegen das verrückte Huhn zu kämpfen."
        },
        "btn-content":"Weiter"
    },
    "footer":{
        "location":"Deutschland"
    },
    "impressum":{
        "main-headline":"Rechtlicher Hinweis",
        "headlines":{
            "imprint":"Impressum",
            "explore":"Das Board erkunden",
            "terms":"Nutzungsbedingungen",
            "scope":"Umfang und Eigentum am Produkt",
            "rights":"Eigentumsrecht",
            "use":"Verwendung des Produkts",
            "disclaimer":"Haftungsausschluss",
            "indemnity":"Schadloshaltung"
        },
        "content":{
            "terms":"Durch den Zugriff auf und die Nutzung von ",
            "terms-1":" (Produkt) erkennen Sie die folgenden Bedingungen und Richtlinien an, die von Zeit zu Zeit aktualisiert werden können. Ich, der genannte Student, behalte mir das Recht vor, diese Bedingungen ohne vorherige Ankündigung zu ändern.",
            
            "scope":" wurde im Rahmen eines Projekts im Webentwicklungs-Bootcamp der",
            "scope-1":"entwickelt. Es dient ausschließlich zu Bildungszwecken und ist nicht für eine umfassende private oder geschäftliche Nutzung vorgesehen. Daher kann keine Gewähr für Verfügbarkeit, Zuverlässigkeit oder Genauigkeit übernommen werden.",
            "scope-2":"Das Design von",
            "scope-3":"ist Eigentum der ",
            "scope-4":". Eine unautorisierte Nutzung, Reproduktion, Änderung oder Weitergabe ist strengstens untersagt.",

            "rights":"Abgesehen vom Design, das Eigentum der",
            "rights-1":", ist, behalte ich, der genannte Student, alle Eigentumsrechte an",
            "rights-2":", einschließlich urheberrechtlich geschützter Materialien, Marken und sonstiger geschützter Informationen.",

            "use":"darf ausschließlich für rechtmäßige Zwecke und in Übereinstimmung mit geltenden Gesetzen verwendet werden. Jegliche Nutzung von",
            "use-1":"für illegale Aktivitäten oder zur Belästigung, Bedrohung oder Schädigung anderer Personen ist strengstens untersagt. Sie sind allein für Ihre Interaktionen mit anderen Nutzern verantwortlich.",

            "disclaimer":" wird 'wie besehen' bereitgestellt, ohne jegliche ausdrückliche oder stillschweigende Garantie, einschließlich, aber nicht beschränkt auf Garantien der Marktgängigkeit, Eignung für einen bestimmten Zweck oder Nichtverletzung von Rechten Dritter. In keinem Fall haften ich, der genannte Student, oder die ",
            "disclaimer-1":"für direkte, indirekte, zufällige, spezielle oder Folgeschäden, einschließlich, aber nicht beschränkt auf entgangenen Gewinn, Datenverlust oder andere immaterielle Verluste, die aus der Nutzung von",

            "indemnity":"Sie erklären sich damit einverstanden, uns, den genannten Studenten, die",
            "indemnity-1":"sowie deren Partner, Mitarbeiter und Vertreter von allen Ansprüchen, Schäden, Kosten oder Haftungen (einschließlich angemessener Rechtskosten) freizustellen, die aus Ihrer Nutzung von",
            "indemnity-2":"oder einem Verstoß gegen dieses Impressum entstehen.",
            "indemnity-3":"Für Fragen oder Mitteilungen kontaktieren Sie uns bitte unter",
            "date":"Datum: "
            
        }
            

    }
   
}
   
