
{
    "navbar": {
        "about-me": "About me",
        "skills": "Skills",
        "projects": "Projects"

    },
    "landingpage":{
        "titel": "Frontend Developer",
        "btn-1": "Check my Work",
        "btn-2": "Contact me",
        "carousel":{
            "location": "Based in Ulm",
            "open-to-work": "Open to work",
            "remote-work": "Available for remote work",
            "titel": "Frontend Developer"
        }
    },
    "Who-I-Am":{
        "headline": "Who I Am",
        "headline-box": "About me",
        "personal-description":"Hey there I'm Raphael! Motivated Frontend Developer with a solid foundation in modern web technologies and roven skills in Windows system administration. I am highly motivated and looking for new challenges.",
        "location": "Based in Ulm (Donau). Open to on-site work or remote and willing to contribute to collaboration",
        "mindset": "As a determined, disciplined and highly motivated young professional, I am completely open to learning new technologies. My ultimate goal is to continuously expand my skills and develop innovative, efficient solutions through my commitment.",
        "approach": "My basic approach is pragmatic: I always break down a large problem into many small, manageable units. This enables me to analyse it clearly and develop solutions step by step."

    },
    "technologies":{
        "comp-headline":"Technologies",
        "headline": "Skill Set",
        "description": "I have a solid foundation in front-end development with HTML, CSS, JavaScript, TypeScript, Angular, Firebase, and Material Design, complemented by knowledge of REST APIs, Git, and Scrum. I enjoy creating user-friendly, responsive interfaces and am eager to keep learning of new tools to stay efficient in the fast-evolving web environment.",
        "another-skill": "You need",
        "another-skill-2":"another skill ?",
        "description-2" :"Feel free to contact me. I look forward to expanding on my previous knowledge.",
        "btn-content": "Let's Talk"
    },
    "portfolio":{
        "headline": "Featured Projects",
        "description-1": "Explore a selection of my work here -",
        "description-2": "Interact with projects to see my skills in action."

    },
    "others-about-me":{
        "headline": "What my colleagus and employers say about me",
        "source": "View full letter.",
        "content": {
            "0":{
                "autor": "Manuela Immendörfer",
                "text" : "We valued Mr. Zwick as a thoroughly reliable and conscientious employee who approached all assigned tasks with great diligence and professional care. "
            },
            "1": {
                "autor": "Jennifer Thiel",
                "text":  "A reliable team player with a professional and diplomatic communication style. He solves problems proactively and contributes to a positive team spirit, even under pressure, by focusing on collaborative and efficient solutions."
            },
            "2": {
                "autor": "Yannick Becker",
                "text": "Raphael was a reliable partner in our Kanban project, focusing on structured front-end development (HTML/CSS/JS) with additional back-end support. He worked with great commitment and ensured a professional, personable collaboration on equal terms."
            }
        }
    },
    "contact-me":{
        "headline": "Contact me",
        "main-headline-1": "Let's work",
        "main-headline-2": "together",
        "problem": "Got a problem to solve?",
        "description": "My aim is not only to implement projects through well-thought-out architecture and user-centred innovation, but also to enrich them in a sustainable way.",
        "link": "Need a Frontend developer?",
        "span": "Lets talk!",
        "mailForm":{
            "name": "What's your name?",
            "name-bsp": "Your name goes here",
            "name-error": "Oops! it seems your name is missing",
            "mail": "What's your email?",
            "mail-bsp": "youremail@email.com",
            "mail-error": "Hoppla! your email is required",
            "mail-vail":"Please check your Emial format  (example@email.com)",
            "message-vail1":"The message must be at least 14 characters long.", 
            "message-vail2":"Please enter a message.",
            "content": "How can I help you?",
            "content-bsp": "Hello Raphael, I am intrested in ....",
            "content-error": "What do you need to develop?",
            "input-content-1":"I've read the privacy-policy",
            "link": " privacy-policy",
            "input-content-2": " and agree to the processing of my data as outlined",
            "input-error":"Please accept the privacy policy",
            "btn-content": "Say Hello ;)"  
        }  
    },
    "mail-overlay":{
        "headline":"Got it! Thanks for your message."
    },
    "project-overlay":{
        "headline":"What is this Project about?",
        "description":{
            "Join":"Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.",
            "El Pollo Loco":"Jump, run and throw game based on object-oriented approach. Help Pepe to find coins and tabasco salsa to fight against the crazy hen."
        },
        "btn-content":"Next project"
    },
    "footer":{
        "location":"Germany",
        "datenschutz": "Privacy Policy",
        "impressum":"Imprint"
    },
    "impressum":{
        "main-headline":"Imprint",
        "headlines":{
            "imprint":"Contact",
            "explore":"Exploring the Board",
            "terms":"Acceptance of terms",
            "scope":"Scope and ownership of the product",
            "rights":"Proprietary rights",
            "use":"Use of the product",
            "disclaimer":"Disclaimer of warranties and limitation of liability",
            "indemnity":"Indemnity"
        },
        "content":{
            "terms":"By accessing and using ",
            "terms-1":"(Product), you acknowledge and agree to the following terms and conditions, and any policies, guidelines, or amendments thereto that may be presented to you from time to time. I, the listed student, may update or change the terms and conditions from time to time without notice.",
            
            "scope":"has been developed as part of a student project in a web development bootcamp at the",
            "scope-1":". It has an educational purpose and is not intended for extensive personal & business usage. As such, we cannot guarantee consistent availability, reliability, accuracy, or any other aspect of quality regarding this Product.",
            "scope-2":"The design of ",
            "scope-3":"is owned by the",
            "scope-4":". Unauthorized use, reproduction, modification, distribution, or replication of the design is strictly prohibited.",

            "rights":"Aside from the design owned by",
            "rights-1":", I, the listed student, retain all proprietary rights in",
            "rights-2":"including any associated copyrighted material, trademarks, and other proprietary information.",

            "use":"is intended to be used for lawful purposes only, in accordance with all applicable laws and regulations. Any use of",
            "use-1":"for illegal activities, or to harass, harm, threaten, or intimidate another person, is strictly prohibited. You are solely responsible for your interactions with other users of",

            "disclaimer":" is provided 'as is' without warranty of any kind, whether express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose, and non-infringement. In no event will I, the listed student, or the ",
            "disclaimer-1":"be liable for any direct, indirect, incidental, special, consequential or exemplary damages, including but not limited to, damages for loss of profits, goodwill, use, data, or other intangible losses, even if we have been advised of the possibility of such damages, arising out of or in connection with the use or performance of",

            "indemnity":"You agree to indemnify, defend and hold harmless us, the listed student, the",
            "indemnity-1":", and our affiliates, partners, officers, directors, agents, and employees, from and against any claim, demand, loss, damage, cost, or liability (including reasonable legal fees) arising out of or relating to your use of",
            "indemnity-2":"and/or your breach of this Legal Notice.",
            "indemnity-3":"For any questions or notices, please contact us at",
            "date":"Date: "
            
        }
    },
    "dataProtection":{
        "main-headline":"Privacy Policy",
        "headline":{
            "headline1":"Responsible",
            "headline2":"Data collection on this website",
            "headline3":"Hosting",
            "headline4":"Your rights",
            "headline5":"Social media"
        },
        "content":{
            "content1":"Contact Form:",
            "content1.5":"If you send me enquiries via the contact form, your details from the enquiry form, including the contact details you provided there, will be stored by me for the purpose of processing the enquiry. I will not pass on this data without your consent.",
            "content2":"My portfolio is hosted by",
            "content2.5":". The provider automatically collects so-called server log files (e.g. IP address, browser type, time), which are technically necessary to ensure the stability and security of the site.",
            "content3":"You have the right to receive information about the origin, recipient and purpose of your stored personal data free of charge at any time. You also have the right to request the correction or deletion of this data. To do so, you can contact me at any time at the address given above.",
            "content5":"On my website, I refer to my profile",
            "content5.1":". Please note that when you click on these links, the privacy policy of the respective platform applies."
        }

    }  
}
